## Data Filtering and Selection

In [21]:
!pip install numpy
!pip install pandas

Requirement already satisfied: numpy in /home/codespace/.local/lib/python3.10/site-packages (1.26.4)
Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.22.4 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [22]:
import numpy as np
import pandas as pd

from pandas import DataFrame

In [23]:
numbers_df = DataFrame(np.arange(0,90,3).reshape(10,3), index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8','row 9','row 10'],columns=['column 1','column 2','column 3'])
numbers_df

        column 1  column 2  column 3
row 1          0         3         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30        33
row 5         36        39        42
row 6         45        48        51
row 7         54        57        60
row 8         63        66        69
row 9         72        75        78
row 10        81        84        87

In [24]:
numbers_df.iloc[0,1]

3

In [25]:
numbers_df.iloc[0,1]=20
numbers_df

        column 1  column 2  column 3
row 1          0        20         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30        33
row 5         36        39        42
row 6         45        48        51
row 7         54        57        60
row 8         63        66        69
row 9         72        75        78
row 10        81        84        87

In [26]:
numbers_df.iloc[[1,2,4],[1,2]]

       column 2  column 3
row 2        12        15
row 3        21        24
row 5        39        42

In [27]:
numbers_df.loc[['row 2','row 3','row 4'], ['column 2', 'column 3']]

       column 2  column 3
row 2        12        15
row 3        21        24
row 4        30        33

#### Comparison operators (> < = <= => == !=) and Masking.

In [28]:
mask = numbers_df > 30
mask

        column 1  column 2  column 3
row 1      False     False     False
row 2      False     False     False
row 3      False     False     False
row 4      False     False      True
row 5       True      True      True
row 6       True      True      True
row 7       True      True      True
row 8       True      True      True
row 9       True      True      True
row 10      True      True      True

In [29]:
numbers_df[mask]

        column 1  column 2  column 3
row 1        NaN       NaN       NaN
row 2        NaN       NaN       NaN
row 3        NaN       NaN       NaN
row 4        NaN       NaN      33.0
row 5       36.0      39.0      42.0
row 6       45.0      48.0      51.0
row 7       54.0      57.0      60.0
row 8       63.0      66.0      69.0
row 9       72.0      75.0      78.0
row 10      81.0      84.0      87.0

In [30]:
numbers_df[numbers_df > 30] = 0
numbers_df

        column 1  column 2  column 3
row 1          0        20         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30         0
row 5          0         0         0
row 6          0         0         0
row 7          0         0         0
row 8          0         0         0
row 9          0         0         0
row 10         0         0         0

Slicing means pulling a section from the DataFrame

In [31]:
numbers_df.iloc[2:6,1:3]

       column 2  column 3
row 3        21        24
row 4        30         0
row 5         0         0
row 6         0         0

In [32]:
#For Loop

#for variable in iterable:
  #do something
for i in range (1,6):
  print (i)
# The number of iteration is known in advance

1
2
3
4
5

In [51]:
def pop_multiple (li, indices):
  indices = sorted(indices, reverse= True)
  removed_element = [li. pop(i)for i in indices]
  return removed_element

li = [2,2,3,0,1,0,3,3]
indices_to_remove = [3,5]
removed_element = pop_multiple(li, indices_to_remove)

li.extend(removed_element)
print("Updated list with extend:", li)

Updated list with extend: [2, 2, 3, 1, 3, 3, 0, 0]

Penjelasan:
1. Karena metode 'pop' tidak bisa menghapus dan mengembalikan lebih dari satu elemen dalam list,maka kita harus mendefinisikan fungsi 'pop_multiple'
2. List yang elemennya akan dihilangkan dijadikan input 1. Sementara, index dari elemen tersebut dijadikan input 2 --> dan def = pop_multiple(li, indices)
3. Dalam blok kode def: urutkan index dari list

In [4]:

guest = ['aaron', 'john', 'pedro', 'kevin', 'mark', 'brad'] 
print(guest) 
guest.pop() 
print(f"{guest.pop()}") 
print(guest)

['aaron', 'john', 'pedro', 'kevin', 'mark', 'brad']
mark
['aaron', 'john', 'pedro', 'kevin']

2
4
6
8
10

In [84]:
factorial(5)

20

In [90]:
for i in range (1,21):
  print (i+2)

3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22